;c04_shell.asm:系统外壳程序，2022-1-19。用于模拟一个操作系统用户接口，比如Linux控制台

;===============================================================================
section shell_header                              ;外壳程序头部
  length       dq shell_end                       ;#0：外壳程序的总长度（字节数）
  entry        dq start                           ;#8：外壳入口点
  linear       dq 0                               ;#16：外壳加载的虚拟（线性）地址

;===============================================================================
section shell_data                                ;外壳程序数据段
  shell_msg    db "OS SHELL-"
  time_buff    times 32 db 0

;===============================================================================
section shell_code                                ;外壳程序代码段

%include "..\common\user_static64.lib"

;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
         bits 64

main:
         ;这里可显示一个界面，比如Windows桌面或者Linux控制台窗口，用于接收用户输入的
         ;命令，包括显示磁盘文件、设置系统参数或者运行一个程序。我们的系统很简单，所以不
         ;提供这些功能。

         ;以下， 模拟按用户的要求运行3个程序......
         mov r8, 100
         mov rax, 3
         syscall
         syscall
         syscall                                  ;用同一个副本创建3个任务

         mov rax, 0
         syscall                                  ;可用显示行，DH=行号
         mov dl, 0
         mov r9b, 0x5f

         mov r12, [rel linear]
  _time:
         lea rbx, [r12 + time_buff]
         mov rax, 1
         syscall

         lea rbx, [r12 + shell_msg]
         mov rax, 2
         syscall

         jmp _time

;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
start:    ;程序的入口点
         call main
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
shell_end:
